In [54]:
import numpy as np 
import pandas as pd

In [55]:
dict1 = {
    "Name":['Harry','Rohan','Shillf','shubh'],
    "Marks":[92,34,24,17],
    "City":['Rampur','Kolkata','Bareilly','Antertica']
  
}

In [56]:
df = pd.DataFrame(dict1)

In [57]:
df

     Name  Marks       City
0   Harry     92     Rampur
1   Rohan     34    Kolkata
2  Shillf     24   Bareilly
3   shubh     17  Antertica

In [58]:
df.to_csv('Friends.csv')

In [59]:
df.to_csv('Friend_index_false.csv' , index=False)

In [60]:
df.head(2)

    Name  Marks     City
0  Harry     92   Rampur
1  Rohan     34  Kolkata

In [61]:
df.tail(2)

     Name  Marks       City
2  Shillf     24   Bareilly
3   shubh     17  Antertica

In [62]:
df.describe()

          Marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [63]:
harry = pd.read_csv('harry.csv')

In [64]:
harry

,Unnamed: 0.3,Unnamed: 0.2,Unnamed: 0.1,Unnamed: 0,Train,Speed,City
0,0,0,0,0,Harry,50,Rampur
1,1,1,1,1,Rohan,34,Kolkata
2,2,2,2,2,Shillf,24,Bareilly
3,3,3,3,3,shubh,17,Antertica

In [65]:
harry['Speed']

0    50
1    34
2    24
3    17
Name: Speed, dtype: int64

In [66]:
harry['Speed'][0] = 50

C:\Users\TECH MOON\AppData\Local\Temp\ipykernel_14400\805298609.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  harry['Speed'][0] = 50

In [67]:
harry

,Unnamed: 0.3,Unnamed: 0.2,Unnamed: 0.1,Unnamed: 0,Train,Speed,City
0,0,0,0,0,Harry,50,Rampur
1,1,1,1,1,Rohan,34,Kolkata
2,2,2,2,2,Shillf,24,Bareilly
3,3,3,3,3,shubh,17,Antertica

In [68]:
harry.to_csv('harry.csv')

In [69]:
harry.index = ['firest' , 'second', 'third', 'forth']

In [70]:
harry

,Unnamed: 0.3,Unnamed: 0.2,Unnamed: 0.1,Unnamed: 0,Train,Speed,City
firest,0,0,0,0,Harry,50,Rampur
second,1,1,1,1,Rohan,34,Kolkata
third,2,2,2,2,Shillf,24,Bareilly
forth,3,3,3,3,shubh,17,Antertica

In [71]:
ser = pd.Series(np.random.rand(34))

In [72]:
type(ser)

pandas.core.series.Series

In [73]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [74]:
type(newdf)

pandas.core.frame.DataFrame

In [75]:
type(newdf)
newdf.head()

          0         1         2         3         4
0  0.015432  0.252869  0.532585  0.235658  0.283023
1  0.832070  0.241930  0.702341  0.013244  0.671369
2  0.863926  0.896361  0.317671  0.523009  0.429233
3  0.507011  0.999281  0.858515  0.582711  0.934292
4  0.662157  0.666001  0.198317  0.124540  0.680274

In [76]:
type(newdf)
newdf.head()

          0         1         2         3         4
0  0.015432  0.252869  0.532585  0.235658  0.283023
1  0.832070  0.241930  0.702341  0.013244  0.671369
2  0.863926  0.896361  0.317671  0.523009  0.429233
3  0.507011  0.999281  0.858515  0.582711  0.934292
4  0.662157  0.666001  0.198317  0.124540  0.680274

In [77]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.516497    0.503818    0.466964    0.506650    0.513811
std      0.282381    0.282995    0.290782    0.298885    0.296153
min      0.002346    0.002922    0.000348    0.001253    0.008521
25%      0.288386    0.258318    0.214582    0.260812    0.251949
50%      0.514149    0.496448    0.443474    0.511062    0.530321
75%      0.753647    0.727784    0.715630    0.761082    0.757394
max      0.998496    0.999281    0.992579    0.999298    0.999540

In [78]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [79]:
newdf[0][0] = "harry"

C:\Users\TECH MOON\AppData\Local\Temp\ipykernel_14400\2771891818.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0] = "harry"
C:\Users\TECH MOON\AppData\Local\Temp\ipykernel_14400\2771891818.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'harry' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0] = "harry"

In [80]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [81]:
newdf.head()

          0         1         2         3         4
0     harry  0.252869  0.532585  0.235658  0.283023
1   0.83207  0.241930  0.702341  0.013244  0.671369
2  0.863926  0.896361  0.317671  0.523009  0.429233
3  0.507011  0.999281  0.858515  0.582711  0.934292
4  0.662157  0.666001  0.198317  0.124540  0.680274

In [82]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [83]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [84]:
newdf.to_numpy()

array([['harry', 0.2528689101860907, 0.5325852667621173,
        0.2356583715235665, 0.2830230275961576],
       [0.8320704194575624, 0.2419298050982167, 0.7023407301972858,
        0.013244468242887386, 0.671369358274426],
       [0.8639260964272027, 0.8963610236847048, 0.31767055305634684,
        0.5230086007669146, 0.42923268841484397],
       ...,
       [0.828448339103605, 0.6909660360345605, 0.41117005248333727,
        0.5713122495186724, 0.6680449656020524],
       [0.34253556056188317, 0.9312817707655808, 0.12728988486654358,
        0.6271853451138026, 0.806191842394158],
       [0.28929619784218985, 0.827161112368297, 0.9811518946842396,
        0.34591366877191, 0.40606893553732026]],
      shape=(334, 5), dtype=object)

In [85]:
newdf[0][0] = 0.3

In [86]:
newdf.head()

          0         1         2         3         4
0       0.3  0.252869  0.532585  0.235658  0.283023
1   0.83207  0.241930  0.702341  0.013244  0.671369
2  0.863926  0.896361  0.317671  0.523009  0.429233
3  0.507011  0.999281  0.858515  0.582711  0.934292
4  0.662157  0.666001  0.198317  0.124540  0.680274

In [87]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.3,0.83207,0.863926,0.507011,0.662157,0.780996,0.431355,0.54929,0.938368,0.370458,...,0.771972,0.793297,0.157072,0.838883,0.311091,0.014345,0.25907,0.828448,0.342536,0.289296
1,0.252869,0.24193,0.896361,0.999281,0.666001,0.784059,0.284604,0.25874,0.513418,0.290937,...,0.441698,0.238378,0.039026,0.210539,0.592879,0.013618,0.0435,0.690966,0.931282,0.827161
2,0.532585,0.702341,0.317671,0.858515,0.198317,0.570585,0.044602,0.250286,0.683743,0.37647,...,0.940169,0.111329,0.101729,0.92978,0.856687,0.527774,0.416964,0.41117,0.12729,0.981152
3,0.235658,0.013244,0.523009,0.582711,0.12454,0.736965,0.592725,0.54751,0.512942,0.323651,...,0.165252,0.919766,0.958662,0.003557,0.931366,0.685218,0.909853,0.571312,0.627185,0.345914
4,0.283023,0.671369,0.429233,0.934292,0.680274,0.194058,0.245376,0.55265,0.868824,0.879242,...,0.114462,0.044809,0.735187,0.092779,0.012112,0.731498,0.484498,0.668045,0.806192,0.406069

In [88]:
newdf.head()

          0         1         2         3         4
0       0.3  0.252869  0.532585  0.235658  0.283023
1   0.83207  0.241930  0.702341  0.013244  0.671369
2  0.863926  0.896361  0.317671  0.523009  0.429233
3  0.507011  0.999281  0.858515  0.582711  0.934292
4  0.662157  0.666001  0.198317  0.124540  0.680274

In [89]:
newdf.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.283023  0.235658  0.532585  0.252869       0.3
1    0.671369  0.013244  0.702341  0.241930   0.83207
2    0.429233  0.523009  0.317671  0.896361  0.863926
3    0.934292  0.582711  0.858515  0.999281  0.507011
4    0.680274  0.124540  0.198317  0.666001  0.662157
..        ...       ...       ...       ...       ...
329  0.731498  0.685218  0.527774  0.013618  0.014345
330  0.484498  0.909853  0.416964  0.043500   0.25907
331  0.668045  0.571312  0.411170  0.690966  0.828448
332  0.806192  0.627185  0.127290  0.931282  0.342536
333  0.406069  0.345914  0.981152  0.827161  0.289296

[334 rows x 5 columns]

In [90]:
type(newdf[0])

pandas.core.series.Series

In [91]:
newdf2 = newdf.copy()

In [92]:
newdf2[0][0] = 9783

C:\Users\TECH MOON\AppData\Local\Temp\ipykernel_14400\3264728190.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf2[0][0] = 9783
C:\Users\TECH MOON\AppData\Local\Temp\ipykernel_14400\3264728190.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0] = 9783

In [93]:
newdf

            0         1         2         3         4
0         0.3  0.252869  0.532585  0.235658  0.283023
1     0.83207  0.241930  0.702341  0.013244  0.671369
2    0.863926  0.896361  0.317671  0.523009  0.429233
3    0.507011  0.999281  0.858515  0.582711  0.934292
4    0.662157  0.666001  0.198317  0.124540  0.680274
..        ...       ...       ...       ...       ...
329  0.014345  0.013618  0.527774  0.685218  0.731498
330   0.25907  0.043500  0.416964  0.909853  0.484498
331  0.828448  0.690966  0.411170  0.571312  0.668045
332  0.342536  0.931282  0.127290  0.627185  0.806192
333  0.289296  0.827161  0.981152  0.345914  0.406069

[334 rows x 5 columns]

In [94]:
newdf.loc[0,0] = 654

In [95]:
newdf.head(2)

         0         1         2         3         4
0      654  0.252869  0.532585  0.235658  0.283023
1  0.83207  0.241930  0.702341  0.013244  0.671369

In [96]:
newdf.columns = list("ABCDE")

In [97]:
newdf.head(2)

         A         B         C         D         E
0      654  0.252869  0.532585  0.235658  0.283023
1  0.83207  0.241930  0.702341  0.013244  0.671369

In [98]:
newdf.loc[0,'A'] = 65445

In [99]:
newdf.head()

          A         B         C         D         E
0     65445  0.252869  0.532585  0.235658  0.283023
1   0.83207  0.241930  0.702341  0.013244  0.671369
2  0.863926  0.896361  0.317671  0.523009  0.429233
3  0.507011  0.999281  0.858515  0.582711  0.934292
4  0.662157  0.666001  0.198317  0.124540  0.680274

In [100]:
newdf = newdf.drop(0, axis=1)

KeyError: '[0] not found in axis'

In [ ]:
newdf.head()

          A         B         C         D         E
0     65445  0.710873  0.074358  0.954380  0.690093
1  0.051302  0.907156  0.028111  0.921337  0.292656
2  0.716735  0.158713  0.055904  0.319585  0.269497
3  0.648811  0.585359  0.562049  0.474939  0.976969
4  0.894322  0.870547  0.056762  0.368319  0.728797

In [ ]:
newdf.loc[[1,2], ['C','D']]

          C         D
1  0.028111  0.921337
2  0.055904  0.319585

In [ ]:
newdf.head()

          A         B         C         D         E
0     65445  0.710873  0.074358  0.954380  0.690093
1  0.051302  0.907156  0.028111  0.921337  0.292656
2  0.716735  0.158713  0.055904  0.319585  0.269497
3  0.648811  0.585359  0.562049  0.474939  0.976969
4  0.894322  0.870547  0.056762  0.368319  0.728797

In [ ]:
newdf.loc [:, ['C','D']]

            C         D
0    0.074358  0.954380
1    0.028111  0.921337
2    0.055904  0.319585
3    0.562049  0.474939
4    0.056762  0.368319
..        ...       ...
329  0.067828  0.247678
330  0.052182  0.466925
331  0.931955  0.571997
332  0.555449  0.775795
333  0.609143  0.688164

[334 rows x 2 columns]

In [ ]:
newdf.loc [[1,2], :]

          A         B         C         D         E
1  0.051302  0.907156  0.028111  0.921337  0.292656
2  0.716735  0.158713  0.055904  0.319585  0.269497

In [ ]:
newdf.loc[(newdf['A']<0.3) & (newdf['C']>0.1)]

            A         B         C         D         E
5    0.196119  0.692357  0.714266  0.581380  0.932926
8    0.145405  0.729277  0.723826  0.838042  0.596286
10   0.104351  0.302003  0.450148  0.929214  0.009304
24   0.170082  0.858515  0.538320  0.610253  0.072365
29   0.060716  0.973515  0.614883  0.279222  0.931502
..        ...       ...       ...       ...       ...
307  0.277613  0.548435  0.564745  0.027728  0.123209
309  0.091199  0.986044  0.240789  0.142078  0.004457
310  0.135231  0.274707  0.513421  0.485863  0.683701
312  0.126071  0.376452  0.168308  0.889699  0.699515
321  0.061599  0.196031  0.755003  0.026017  0.015401

[87 rows x 5 columns]

In [ ]:
newdf.head(2)

          A         B         C         D         E
0     65445  0.710873  0.074358  0.954380  0.690093
1  0.051302  0.907156  0.028111  0.921337  0.292656

In [ ]:
newdf.iloc[0,4]

np.float64(0.6900931197142058)

In [ ]:
newdf.iloc[[0,1], [1,2]]

          B         C
0  0.710873  0.074358
1  0.907156  0.028111

In [ ]:
newdf.head(3)

          A         B         C         D         E
0     65445  0.710873  0.074358  0.954380  0.690093
1  0.051302  0.907156  0.028111  0.921337  0.292656
2  0.716735  0.158713  0.055904  0.319585  0.269497

In [ ]:
newdf.drop(['A','D'], axis=1, inplace=True)

In [ ]:
newdf.head(3)

          B         C         E
0  0.710873  0.074358  0.690093
1  0.907156  0.028111  0.292656
2  0.158713  0.055904  0.269497

In [ ]:
newdf.reset_index(drop=True,inplace=True)

In [ ]:
newdf.head(3)

          B         C         E
0  0.710873  0.074358  0.690093
1  0.907156  0.028111  0.292656
2  0.158713  0.055904  0.269497

In [114]:
newdf.loc[:,['B']] = 34

In [117]:
newdf.head()

          A   B         C         D         E
0     65445  34  0.532585  0.235658  0.283023
1   0.83207  34  0.702341  0.013244  0.671369
2  0.863926  34  0.317671  0.523009  0.429233
3  0.507011  34  0.858515  0.582711  0.934292
4  0.662157  34  0.198317  0.124540  0.680274

In [124]:
df = pd.DataFrame({"name": ['Alfred', 'Batman','Ctawoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                   pd.NaT]})

In [125]:
df.head()

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Ctawoman   Bullwhip        NaT

In [126]:
df.dropna()

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [127]:
df.dropna(how='all')

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Ctawoman   Bullwhip        NaT

In [128]:
df.drop_duplicates(subset=['name'], keep=False)

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Ctawoman   Bullwhip        NaT

In [130]:
df.shape

(3, 3)

In [131]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 204.0+ bytes

In [132]:
df['name'].value_counts(dropna=False)

name
Alfred      1
Batman      1
Ctawoman    1
Name: count, dtype: int64

In [133]:
df.notnull()

   name    toy   born
0  True  False  False
1  True   True   True
2  True   True  False